Repository: RKWKomZe/RkwPdf2Content
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# be.commands.init_pdf
source: Init PDF
de: PDF initialisieren

# be.commands.render_document
source: Render
de: TYPO3 Struktur erstellen

# be.commands.target_page
source: Target Page
de: Ziel-Seite

# be.commands.first_page_title
source: First page title
de: Titel der ersten Seite (Elternseite)

# be.commands.document_structure
source: Document structure
de: Kapitelstruktur

# be.commands.create_main_chapter
source: Create main chapter
de: Hauptkapitel erstellen

# be.commands.create_sub_chapter
source: Create sub chapter
de: Unterkapitel erstellen

# be.commands.create_text_element
source: Create text element
de: Textelement erstellen

# be.commands.use_marked_text_as_title
source: Use marked text as title
de: Markierten Text als Titel verwenden

# be.commands.use_marked_text_as_text
source: Use marked text as text element
de: Markierten Text als Text verwenden

# be.commands.delete_nodes
source: Delete nodes and sub-nodes
de: Knoten und Unterknoten löschen

# be.commands.chapter_number
source: Chapter number
de: Kapitelnummer

# be.commands.title
source: Title
de: Titel

# be.commands.save
source: Save
de: Speichern

# be.commands.cancel
source: Cancel
de: Zurücknehmen

# be.msg.render_success
source: Rendering below page with uid %1$s with first page title "%2$s" was successful!
de: TYPO3 Struktur unterhalb der Seite mit uid %1$s und der ersten Seite "%2$s" erfolgreich erzeugt!

# be.msg.pdfservice_pdf2html_empty
source: PDF2HTML result is empty!
de: PDF2HTML Ergebnis ist leer!

# be.msg.pdfservice_pdfbox_missing
source: PDF BOX file does not exist! Setup path: %1$s
de: PDF BOX JAR Datei konnte nicht gefunden werden. Setup-Pfad ist: %1$s

# be.msg.pdfservice_pdffile_missing
source: Upload or copy problem. PDF file does not exist!
de: Upload- oder Kopier-Problem. PDF-Datei existiert nicht!

# be.js.label.error
source: Error
de: Fehler

# be.js.msg.error_target_page
source: Target page not defined! Please choose a page or a folder.
de: Zielseite nicht definiert! Bitte wählen Sie eine Zielseite (oder Ordner) aus.

# be.js.msg.error_page_title
source: Page title not set! Please enter a page title for the first PDF page.
de: Titel für erste Seite nicht gesetzt. Bitte geben Sie einen Seitentitel für die erste Seite (Elternseite) ein.

# be.js.msg.error_pdf_not_init
source: PDF not initialized!
de: PDF nicht initialisiert!

# be.js.msg.error_empty_doc
source: Empty document structure!
de: Kaptitelstruktur ist leer!

# be.js.msg.error_process_begin
source: Error while processing pdf
de: Fehler bei PDF-Umwandlung

# be.js.msg.error_ajax_request
source: Could not succeed ajax request!
de: Ajax-Request fehlgeschlagen!

# be.js.msg.error_pdf_file
source: Please insert a valid PDF file.
de: Bitte laden Sie ein gültiges PDF-Dokument hoch

# be.js.msg.confirm_render
source: Create TYPO3 site and content element structure now? You cannot undo this step!
de: TYPO3-Seitenstruktur erzeugen? Dieser Schritt kann nicht rückgängig gemacht werden!

# be.js.msg.confirm_init
source: Do you really want to initialize this PDF?
de: PDF wirklich initialisieren?
